// Додаткове завдання

// Компонент рендериться на маршрут /news 
// Компонент рендерить: 
//  - поле для пошуку новин по ключовому слову
//  - список новин, які отримує з бекенда
// Якщо поле для пошуку заповнене - поряд з іконкою лупи повинна зʼявлятись кнопка з іконкою хрестика, по кліку на яке, поле для пошуку очищується. Пошук новин по вмісту ключового слова в заголовку новини відбувається по сабміту або кліку на іконку лупи. 
// Новини повинні бути відсортовані по даті, найновіші новини на початку переліку.
// Клік по лінку ReadMore на карточці з новиною повинен переадресувати користувача на ресурс з новиною в окремій вкладці браузера
